ЛИС2/src/Documents/АттестатАккредитации/АттестатАккредитации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АттестатАккредитации</name>
  <registerRecords>InformationRegister.лис_ПриложениеКАттестатуАккредитации</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерАттестата</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОрганВыдавшийДокумент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВнесенияВРеестр</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лаборатория</name>
    <type>
      <types>CatalogRef.лис_Лаборатории</types>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Приложение</name>
    <attributes>
      <name>РазделУчета</name>
      <type>
        <types>EnumRef.РазделыУчетаЭкоаналитическогоКонтроля</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗагрязняющееВещество</name>
      <type>
        <types>CatalogRef.ВеществаИПараметрыВАтмосферныхОсадках</types>
        <types>CatalogRef.КонтролируемыеПараметрыВПочвеДонныхОтложениях</types>
        <types>CatalogRef.ЗВВода</types>
        <types>CatalogRef.КонтролируемыеПоказателиВВоде</types>
        <types>CatalogRef.ФакторыФизическогоВоздействия</types>
        <types>CatalogRef.ЗВАтмосфера</types>
      </type>
    </attributes>
    <attributes>
      <name>ДиапазонОт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДиапазонДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОКЕИ</types>
      </type>
    </attributes>
    <attributes>
      <name>Методика</name>
      <type>
        <types>CatalogRef.МетодикиОпределенияИзмеренияАнализа</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ЛИС2/src/Enums/РазделыУчетаЭкоаналитическогоКонтроля/РазделыУчетаЭкоаналитическогоКонтроля.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РазделыУчетаЭкоаналитическогоКонтроля</name>
  <enumValues>
    <name>ПромышленныеВыбросы</name>
  </enumValues>
  <enumValues>
    <name>АтмосферныйВоздух</name>
  </enumValues>
  <enumValues>
    <name>СточныеВоды</name>
  </enumValues>
  <enumValues>
    <name>ПриродныеВоды</name>
  </enumValues>
  <enumValues>
    <name>Почвы</name>
  </enumValues>
  <enumValues>
    <name>ДонныеОтложения</name>
  </enumValues>
  <enumValues>
    <name>ФизическиеФакторы</name>
  </enumValues>
  <enumValues>
    <name>АтмосферныеОсадки</name>
  </enumValues>
</mdclass:Enum>

ЛИС2/src/Catalogs/МетодикиОпределенияИзмеренияАнализа/МетодикиОпределенияИзмеренияАнализа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МетодикиОпределенияИзмеренияАнализа</name>
  <attributes>
    <name>Индекс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МетодАнализа</name>
    <type>
      <types>CatalogRef.лис_МетодыАнализа</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеМетодики</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Издание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Показатель</name>
    <type>
      <types>EnumRef.ПоказателиМетодик</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкруглениеРезультатовИзмерений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантОкругленияИзмерений</name>
    <type>
      <types>EnumRef.ВариантыОкругленияИзмерений</types>
    </type>
  </attributes>
  <attributes>
    <name>ТемператураВоздухаОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТемператураВоздухаДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтносительнаяВлажность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НапряжениеВСети</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НапряжениеВСетиПогрешность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтборОписание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МатериалЕмкости</name>
    <type>
      <types>CatalogRef.МатериалыЕмкости</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОтбора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемАликвоты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокХраненияПробы</name>
    <type>
      <types>CatalogRef.СрокиХраненияПробы</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособКонсервации</name>
    <type>
      <types>CatalogRef.СпособыКонсервации</types>
    </type>
  </attributes>
  <attributes>
    <name>КонсервацияОписание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокХраненияКонсервированнойПробы</name>
    <type>
      <types>CatalogRef.СрокиХраненияПробы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПоказателиФормулы</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДиапазоныИзмерений</name>
    <attributes>
      <name>МетрологическаяХарактеристика</name>
      <type>
        <types>CatalogRef.МетрологическиеХарактеристики</types>
      </type>
    </attributes>
    <attributes>
      <name>ДиапазонИзмеренийОт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДиапазонИзмеренийДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОКЕИ</types>
      </type>
    </attributes>
    <attributes>
      <name>Формула</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоказательПовторяемости</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоказательВоспроизводимости</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоказательТочности</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоказательПравильности</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Формулы</name>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Формула</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КачественныеПоказатели</name>
    <attributes>
      <name>МетрологическаяХарактеристика</name>
      <type>
        <types>CatalogRef.МетрологическиеХарактеристики</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ЛИС2/src/Documents/АттестатАккредитации/Forms/ФормаЗагрузкиПриложенияИзExcel/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// МЕТОДВ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Процедура ЗагрузитьЛисты(АдресФайла)
	ИмяФайлаНаСервере = КаталогВременныхФайлов() + "загрузка из excel (" + Формат(ТекущаяДата(), "ДФ=""гггг.ММ.дд ЧЧ-мм-сс""") + ").xls";
	Файл = ПолучитьИзВременногоХранилища(АдресФайла);
	Файл.Записать(ИмяФайлаНаСервере);
	
	Попытка
		Excel = Новый COMObject("Excel.Application");
	Исключение
		Сообщить("Ошибка при загрузке Microsoft Excel." + Символы.ПС + ОписаниеОшибки(), СтатусСообщения.Внимание);
		Возврат;
	КонецПопытки;
	
	Попытка
		ExcelФайл = Excel.WorkBooks.Open(ИмяФайлаНаСервере);
	Исключение
		Сообщить("Невозможно открыть файл " + ИмяФайлаНаСервере + " !!!" + Символы.ПС + ОписаниеОшибки(), СтатусСообщения.Важное);
		Возврат;
	КонецПопытки;
		
	Элементы.Лист.СписокВыбора.Очистить();
	КоличествоЛистов = ExcelФайл.Sheets.Count;
	Для НомерЛиста = 1 по КоличествоЛистов Цикл
		Элементы.Лист.СписокВыбора.Добавить(Строка(ExcelФайл.Sheets(НомерЛиста).Name));
	КонецЦикла;
	
	Если Элементы.Лист.СписокВыбора.Количество() > 0 Тогда
		Лист = Элементы.Лист.СписокВыбора[0].Значение;
	Иначе
		Лист = "";
	КонецЕсли;
	
	Excel.Application.DisplayAlerts = Ложь;
	Excel.Application.Quit();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗагрузкуНаСервере()
	Попытка
		Excel = Новый COMObject("Excel.Application");		
	Исключение
		Сообщить("Ошибка при загрузке Microsoft Excel." + Символы.ПС + ОписаниеОшибки(), СтатусСообщения.Внимание);
		Возврат;
	КонецПопытки;
	
	Попытка
		ExcelФайл = Excel.WorkBooks.Open(ИмяФайлаНаСервере);	
	Исключение
		Сообщить("Невозможно открыть файл " + ИмяФайлаНаСервере + " !!!" + Символы.ПС + ОписаниеОшибки(), СтатусСообщения.Важное);
		Возврат;
	КонецПопытки;
	
	ТаблицаПриложения.Очистить();
	
	ExcelФайл.Sheets(Лист).Select();
	
	СтолбецНомер = рСтолбец;
	СтрокаНомер = рСтрока;
	РазделУчета = Excel.Cells(СтрокаНомер, СтолбецНомер).Value;
	Если Не ЗначениеЗаполнено(РазделУчета) Тогда
		Сообщить("Не найдено кадастровых номеров. Проверьте лист, строку и столбец, с которых начинается загрузка");
	Иначе
		Пока ЗначениеЗаполнено(РазделУчета) Цикл
			НоваяСтрока = ТаблицаПриложения.Добавить();
			
			НоваяСтрока.РазделУчета 			= ЗначениеПеречисленияПоСинониму(РазделУчета, Перечисления.РазделыУчетаЭкоаналитическогоКонтроля);
			НоваяСтрока.ЗагрязняющееВещество 	= НайтиЗВ(Excel.Cells(СтрокаНомер, СтолбецНомер+1).Value, НоваяСтрока.РазделУчета);
			НоваяСтрока.ДиапазонОт 				= Число(Excel.Cells(СтрокаНомер, СтолбецНомер+2).Value);
			НоваяСтрока.ДиапазонДо 				= Число(Excel.Cells(СтрокаНомер, СтолбецНомер+3).Value);
			НоваяСтрока.ЕдиницаИзмерения 		= Справочники.ОКЕИ.НайтиПоНаименованию(Excel.Cells(СтрокаНомер, СтолбецНомер+4).Value);
			НоваяСтрока.Методика 				= Справочники.МетодикиОпределенияИзмеренияАнализа.НайтиПоНаименованию(Excel.Cells(СтрокаНомер, СтолбецНомер+5).Value);
			
			СтрокаНомер = СтрокаНомер + 1;
			РазделУчета = Excel.Cells(СтрокаНомер, СтолбецНомер).Value;
		КонецЦикла;
	КонецЕсли; 
	
	Excel.Application.DisplayAlerts = Ложь;
	Excel.Application.Quit();
КонецПроцедуры

Функция ЗначениеПеречисленияПоСинониму(Синоним, ПеречислениеМенеджер)
	
	ПолученноеЗначение = ПеречислениеМенеджер.ПустаяСсылка(); 
	ЗначенияПеречисления = ПолученноеЗначение.Метаданные().ЗначенияПеречисления; 
	Значение = ЗначенияПеречисления.Найти(СтрЗаменить(Синоним, " ", "")); 
	Если Значение <> Неопределено Тогда 
		ПолученноеЗначение = ПеречислениеМенеджер[ЗначенияПеречисления.Индекс(Значение)]; 
	КонецЕсли;
	
	Возврат ПолученноеЗначение;
	
КонецФункции

Функция НайтиЗВ(Наименование, РазделУчета)
	
	Если РазделУчета = ПредопределенноеЗначение("Перечисление.РазделыУчетаЭкоаналитическогоКонтроля.АтмосферныйВоздух")
		ИЛИ РазделУчета = ПредопределенноеЗначение("Перечисление.РазделыУчетаЭкоаналитическогоКонтроля.ПромышленныеВыбросы") Тогда
		
		НайденнйЗВ = Справочники.ЗВАтмосфера.НайтиПоНаименованию(Наименование);
		Если ЗначениеЗаполнено(НайденнйЗВ) Тогда
			Возврат НайденнйЗВ;
		КонецЕсли;
		
	ИначеЕсли РазделУчета = ПредопределенноеЗначение("Перечисление.РазделыУчетаЭкоаналитическогоКонтроля.СточныеВоды")
		ИЛИ РазделУчета = ПредопределенноеЗначение("Перечисление.РазделыУчетаЭкоаналитическогоКонтроля.ПриродныеВоды") Тогда
		
		НайденнйЗВ = Справочники.ЗВВода.НайтиПоНаименованию(Наименование);
		Если ЗначениеЗаполнено(НайденнйЗВ) Тогда
			Возврат НайденнйЗВ;
		КонецЕсли;
		
		НайденнйЗВ = Справочники.КонтролируемыеПоказателиВВоде.НайтиПоНаименованию(Наименование);
		Если ЗначениеЗаполнено(НайденнйЗВ) Тогда
			Возврат НайденнйЗВ;
		КонецЕсли;
		
	ИначеЕсли РазделУчета = ПредопределенноеЗначение("Перечисление.РазделыУчетаЭкоаналитическогоКонтроля.Почвы")
		ИЛИ РазделУчета = ПредопределенноеЗначение("Перечисление.РазделыУчетаЭкоаналитическогоКонтроля.Почвы") Тогда
		
		НайденнйЗВ = Справочники.КонтролируемыеПараметрыВПочвеДонныхОтложениях.НайтиПоНаименованию(Наименование);
		Если ЗначениеЗаполнено(НайденнйЗВ) Тогда
			Возврат НайденнйЗВ;
		КонецЕсли;
		
	ИначеЕсли РазделУчета = ПредопределенноеЗначение("Перечисление.РазделыУчетаЭкоаналитическогоКонтроля.ФизическиеФакторы") Тогда
		
		НайденнйЗВ = Справочники.ФакторыФизическогоВоздействия.НайтиПоНаименованию(Наименование);
		Если ЗначениеЗаполнено(НайденнйЗВ) Тогда
			Возврат НайденнйЗВ;
		КонецЕсли;
		
	ИначеЕсли РазделУчета = ПредопределенноеЗначение("Перечисление.РазделыУчетаЭкоаналитическогоКонтроля.АтмосферныеОсадки") Тогда
		
		НайденнйЗВ = Справочники.ВеществаИПараметрыВАтмосферныхОсадках.НайтиПоНаименованию(Наименование);
		Если ЗначениеЗаполнено(НайденнйЗВ) Тогда
			Возврат НайденнйЗВ;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	рСтрока = 1;
	рСтолбец = 1;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ПеренестиВФорму(Команда)
	
	Для Каждого Строка Из ТаблицаПриложения Цикл
		НоваяСтрока = ВладелецФормы.Объект.Приложение.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;
	
	ВладелецФормы.Модифицированность = Истина;
	ЭтаФорма.Закрыть();
КонецПроцедуры



&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ИмяФайла = "";
	АдресФайла = Неопределено;
	НачатьПомещениеФайла(Новый ОписаниеОповещения("ЗавершениеВыбораФайла", ЭтотОбъект), АдресФайла, ИмяФайла, , УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВыбораФайла(Результат, АдресФайла, ИмяФайла, ДополнительныеПараметры) Экспорт
	Если Результат Тогда
		ЭтаФорма.ИмяФайла = ИмяФайла;
		ЗагрузитьЛисты(АдресФайла);
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ВыполнитьЗагрузку(Команда)
	Если Не ЗначениеЗаполнено(ИмяФайла) Тогда
		ПоказатьПредупреждение(, "Не выбран файл!");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Лист) Тогда
		ПоказатьПредупреждение(, "Не выбран лист в файле!");
		Возврат;
	КонецЕсли;
	
	ВыполнитьЗагрузкуНаСервере();
	ПоказатьПредупреждение(, "Загрузка завершена!");
КонецПроцедуры
